In [11]:
import pandas as pd
import numpy as np

In [9]:
def extract_city_name(df):
    """
    Chicago, Il -> Chicago for city_name column
    """
    
    df['city_name'] = df['city_and_code'].str.split(',').str.get(0)
    return df

def add_country_name(df, country_name=None):
    """
    Chicago -> Chicago-Us for city_name column
    """
    
    col = 'city_name'
    df['city_and_country'] = df[col] + country_name
    return df

df_p = pd.DataFrame({'city_and_code': ['Chicago, IL']})

add_country_name(extract_city_name(df_p), country_name='US')

  city_and_code city_name city_and_country
0   Chicago, IL   Chicago        ChicagoUS

In [8]:
(df_p.pipe(extract_city_name).pipe(add_country_name, country_name='US'))

  city_and_code city_name city_and_country
0   Chicago, IL   Chicago        ChicagoUS

In [14]:
df = pd.DataFrame({
        'one': pd.Series(np.random.randn(3), index=['a', 'b', 'c']),
        'two': pd.Series(np.random.randn(4), index=['a', 'b', 'c', 'd']),
        'three': pd.Series(np.random.randn(3), index=['b', 'c', 'd'])})

df

        one       two     three
a -0.969842 -0.115352       NaN
b  0.269477  0.280248  1.066170
c  0.674965  0.438499 -0.011279
d       NaN -0.339393 -0.538633

In [15]:
df.apply(np.mean)

one     -0.008466
two      0.066001
three    0.172086
dtype: float64

In [16]:
df.apply(np.mean, axis=1)

a   -0.542597
b    0.538631
c    0.367395
d   -0.439013
dtype: float64

In [17]:
df.apply(lambda x: x.max() - x.min())

one      1.644807
two      0.777892
three    1.604803
dtype: float64

In [18]:
df.apply(np.cumsum)

        one       two     three
a -0.969842 -0.115352       NaN
b -0.700365  0.164896  1.066170
c -0.025399  0.603395  1.054891
d       NaN  0.264002  0.516258

In [19]:
df.apply(np.exp)

        one       two     three
a  0.379143  0.891053       NaN
b  1.309279  1.323458  2.904234
c  1.963965  1.550379  0.988784
d       NaN  0.712203  0.583545

In [20]:
def own_function(x):
    return x*x

df.apply(own_function)

        one       two     three
a  0.940593  0.013306       NaN
b  0.072618  0.078539  1.136718
c  0.455578  0.192282  0.000127
d       NaN  0.115188  0.290126

In [21]:
def subtract_and_divide(x, sub, divide=1):
    return (x - sub) / divide

In [22]:
df.apply(subtract_and_divide, args=(5,3))

        one       two     three
a -1.989947 -1.705117       NaN
b -1.576841 -1.573251 -1.311277
c -1.441678 -1.520500 -1.670426
d       NaN -1.779798 -1.846211

In [24]:
def subtract(x, sub):
    return (x - sub)

df.apply(subtract, args=(5,))

        one       two     three
a -5.969842 -5.115352       NaN
b -4.730523 -4.719752 -3.933830
c -4.325035 -4.561501 -5.011279
d       NaN -5.339393 -5.538633